/*
This coding example shows how to use this generic format. It employs a do while to call a subroutine
exactly 10 times:

*/

j = 1
do while j <= 10
call digits
j = j + 1
end